<script setup lang="ts">
import {Head} from "@inertiajs/vue3";
import {AppLayout} from "@/layouts";
</script>

<template>
    <Head title="Положение о конфиденциальности"/>

    <AppLayout>
        <div class="container lg:w-1/2 m-auto p-5">
            <div class="flex flex-col gap-3">
                <h2 class="text-center font-bold">1. Общие положения</h2>
                <p>
                    <strong>1.1.</strong> Настоящая Политика
                    конфиденциальности (далее – «<strong>Политика</strong>») принята Администратором и действует в
                    отношении
                    всей информации, которую Администратор может получить о Пользователе сайта
                    <strong>https://example.com/</strong>
                    (далее – «<strong>Сайт</strong>» или «<strong>Сервис</strong>») с любого устройства и при
                    коммуникации с
                    Администратором в любой форме.
                </p>
                <p>
                    <strong>1.2.</strong> Используя Cайт (просмотр, чтение текста, отправка или загрузка информации) и
                    предоставляя свои персональные данные, Пользователь Сайта дает согласие на обработку персональных
                    данных в соответствии с данной Политикой, если дополнительные требования к согласию не установлены
                    настоящей Политикой.
                </p>
                <p>
                    <strong>1.3.</strong>Для целей
                    настоящей Политики под «<strong>Администратором</strong>» понимается юридическое лицо
                    <strong>Общество с ограниченной ответственностью "[НАЗВАНИЕ КОМПАНИИ]"</strong>, адрес места
                    нахождения: [ИНДЕКС], [РЕГИОН], [ГОРОД], [УЛИЦА, ДОМ], ОГРН [ОГРН], ИНН [ИНН].
                </p>
                <h2 class="text-center font-bold">2. Персональные данные</h2>
                <p>
                    <strong>2.1.</strong> <strong>Персональные данные</strong> – любая информация, относящаяся прямо или
                    косвенно к определенному или определяемому физическому лицу (субъекту персональных данных) -
                    Пользователю.
                </p>
                <p>
                    <strong>2.2.</strong> <strong>Обработка персональных данных</strong> – любое действие (операция) или
                    совокупность действий (операций) с персональными данными, совершаемое с использованием средств
                    автоматизации или без их использования, в том числе сбор, запись, систематизация, накопление,
                    хранение, уточнение (обновление, изменение), извлечение, использование, передача (предоставление,
                    доступ), обезличивание, блокирование, удаление, уничтожение.
                </p>
                <p>
                    <strong>2.3.</strong> Администратор
                    производит обработку следующих персональных данных: фамилии, имени и отчества, адреса электронной
                    почты, номера телефона.
                </p>
                <p>
                    <strong>2.4.</strong> Cookies –
                    небольшие по размеру текстовые файлы, хранящиеся в браузере посетителей Сервиса. На совокупности
                    различных веб-проектов Администратора (при просмотре Сервиса происходит автоматический сбор (из
                    Cookies) следующих обезличенных статистических данных о посетителе Сервиса, в том числе:
                </p>
                <p>- Referer; </p>
                <p>- ClientID (идентификатор браузера по файлу Cookie);</p>
                <p>
                    <strong>2.5.</strong> Посетитель Сервиса может самостоятельно управлять файлами Cookies, путем
                    изменения настроек браузера.
                </p>
                <p>
                    <strong>2.6.</strong> Изменения
                    пользовательских настроек, в результате которых файлы Cookies будут заблокированы или удалены, могут
                    привести к недоступности отдельных компонентов Сервиса.
                </p>
                <h2 class="text-center font-bold">3. Цели обработки персональных данных</h2>
                <p>
                    <strong>3.1.</strong> Администратор обрабатывает персональные данные Пользователя для целей
                    информационно-справочного обслуживания, в том числе предоставления информации о услугах
                    Администратора, а также идентификации Пользователя Сервиса.
                </p>
                <h2 class="text-center font-bold">4. Порядок и условия обработки персональных данных</h2>
                <p>
                    <strong>4.1.</strong> Обработка
                    персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в
                    том числе в информационных системах персональных данных с использованием средств автоматизации или
                    без использования таких средств.
                </p>
                <p>
                    <strong>4.2.</strong> Обработка
                    персональных данных Пользователя осуществляется на срок действия договорных и иных правоотношений
                    Пользователя и Администратора, любым законным способом, в том числе в информационных системах
                    персональных данных с использованием средств автоматизации или без использования таких средств.
                </p>
                <p>
                    <strong>4.3.</strong> Все персональные
                    данные Администратор получает непосредственно от Пользователя или от его представителя, либо от
                    лица, поручившего Администратору обработку персональных данных Пользователя, за исключением случаев,
                    предусмотренных законодательством Российской Федерации.
                </p>
                <p>
                    <strong>4.4.</strong> Администратор
                    вправе передавать персональные данные органам дознания и следствия, иным уполномоченным органам по
                    основаниям, предусмотренным действующим законодательством Российской Федерации.
                </p>
                <p>
                    <strong>4.5.</strong> Правовым
                    основанием обработки персональных данных Администратором являются: Конституция РФ, Гражданский
                    кодекс РФ, Трудовой кодекс РФ, согласие Пользователя на обработку его персональных данных, договоры,
                    заключаемые между Администратором и Пользователем.
                </p>
                <p>
                    <strong>4.6.</strong>Для обеспечения
                    защиты персональных данных Пользователя при их обработке Администратором приняты следующие меры от
                    несанкционированного доступа, а также иных неправомерных действий в отношении персональных данных
                    Пользователя:
                </p>
                <p>
                    <strong>4.6.1.</strong> Правовые меры,
                    включающие в себя, в том числе создание документов, направленных на защиту персональных данных:
                    положение о защите персональных данных, издание приказа о назначении лиц, ответственных за защиту
                    персональных данных, заключение соглашений о конфиденциальности с лицами, имеющими доступ к
                    персональным данным.
                </p>
                <p>
                    <strong>4.6.2.</strong> Организационные
                    меры, в том числе назначение лиц, ответственных за защиту персональных данных, хранение персональных
                    данных, содержащихся на материальных носителях, в сейфе.
                </p>
                <p>
                    <strong>4.6.3.</strong> Технические
                    меры: использование средств защиты информации, прошедших процедуру оценки соответствия требованиям
                    законодательства РФ, взаимодействовать с госсистемой обнаружения, предупреждения и ликвидации
                    последствий кибератак.
                </p>
                <h2 class="text-center font-bold">5. Права пользователя</h2>
                <p>
                    <strong>5.1.</strong> Пользователь
                    вправе реализовать свои права, предусмотренные законодательством Российской Федерации о персональных
                    данных, в том числе, но не ограничиваясь:
                </p>
                <p>
                    – уточнять, обновлять свои персональные данные, требовать их
                    блокирования или уничтожения;
                </p>
                <p>
                    – запрашивать у Администратора перечень обрабатываемых персональных
                    данных, правовых оснований обработки, источники их получения, информацию о сроках обработки и
                    хранения, а также иные сведения, связанные с обработкой своих персональных данных.
                </p>
                <h2 class="text-center font-bold">6. Права и обязанности администратора</h2>
                <p>
                    <strong>6.1.</strong> Администратор
                    обязуется использовать полученную персональную информацию Пользователя только в целях, названных в
                    настоящей Политике.
                </p>
                <p>
                    <strong>6.2.</strong> Администратор
                    обязан принимать меры предосторожности для защиты конфиденциальности персональных данных
                    Пользователя согласно порядку, обычно используемого для защиты такого рода информации в деловом
                    обороте.
                </p>
                <p>
                    <strong>6.3.</strong> Администратор
                    обязан хранить персональную информацию Пользователя в течение периода времени, необходимого для
                    целей, указанных в настоящей Политике конфиденциальности, если только более длительный срок хранения
                    не является необходимым в соответствии с действующим законодательством.
                </p>
                <p>
                    <strong>6.4.</strong> Администратор
                    вправе не удалять данные Пользователя, необходимые для хранения в соответствии с действующим
                    законодательством Российской Федерации.
                </p>
                <h2 class="text-center font-bold">7. Заключительные положения</h2>
                <p>
                    <strong>7.1.</strong> Согласие
                    действует до момента достижения Администратором цели обработки персональных данных. Пользователь
                    вправе отозвать настоящее согласие на обработку своих персональных данных, письменно уведомив об
                    этом Администратора по электронной почте.
                </p>
            </div>
        </div>
    </AppLayout>
</template>

<style scoped>

</style>
