<template>
    <Head title="Положение о файлах cookies"/>

    <AppLayout>
        <div class="container lg:w-1/2 m-auto p-5">
            <h2 class="text-center py-4 font-bold">Согласие об использовании файлов cookie</h2>
            <p class="text-left pb-4">
                Настоящим Вы (далее – «<strong>Пользователь</strong>»), в соответствии с Федеральным законом от 27 июля
                2006 года № 152- ФЗ «О персональных данных» (далее – «<strong>Закон 152-ФЗ</strong>») свободно, своей
                волей и
                в своем интересе выражаете Обществу с ограниченной ответственностью "ФЛЕШ-ФОРМАТ" (ИНН 3811123129,
                ОГРН 1083811006091, адрес: 664081, Иркутская область, г Иркутск, ул Зверева, д. 9б ), (далее –
                «<strong>Флеш-формат</strong>»), согласие на
                обработку файлов сookie при использовании интернет-сайта <strong>https://flashformat.ru/</strong> (далее
                - «<strong>Сайт</strong>»)
                на следующих условиях:
            </p>
            <DataTable :columns="columns"
                       :data="dataTable"
            >
                <template #cell-description="{item}">
                    <div v-html="item.description"></div>
                </template>
            </DataTable>
        </div>
    </AppLayout>
</template>

<script setup lang="ts">
import {DataTable} from "@/components";
import {AppLayout} from "@/layouts";
import {Head} from "@inertiajs/vue3";
import type {TableColumn} from "@/types";

const columns: TableColumn[] = [
    {
        key: "id",
        label: "",
        headerClass: "p-0"
    },
    {
        key: "name",
        label: "",
        headerClass: "p-0"
    },
    {
        key: "description",
        label: "",
        headerClass: "p-0"
    }
]

const dataTable = [
    {
        id: 1,
        name: "Способы и средства",
        description: "Любые действия, допустимые российским законодательством," +
            "совершаемые как с использованием средств автоматизации включая сбор," +
            "запись, систематизацию, накопление, хранение, уточнение (обновление, изменение)," +
            "извлечение, использование, блокирование, удаление, уничтожение, в том числе",
    },
    {
        id: 2,
        name: "Перечень обрабатываемых данных",
        description: "<p>- куки (в т.ч. обязательные, аналитические);</p>" +
            "<p>- сведения о действиях пользователя на сайте;</p>" +
            "<p>- технических данных о Вашем устройстве и IP-адресе;</p>",
    },
    {
        id: 3,
        name: "Цель обработки данных",
        description: "Обработка персональных данных осуществляется в целях улучшения работы сайта, совершенствования услуг ООО «Флеш-Формат»",
    },
    {
        id: 4,
        name: "Отзыв Cогласия",
        description: "Пользователь может отказаться от обработки Данных, которые " +
            "носят необязательный характер, в настройках своего браузера." +
            "При этом отказ от использования необязательных Данных может " +
            "отразиться на пользовательском интерфейсе и некоторых компонентах Сайта.",
    },
    {
        id: 5,
        name: "Политика Оператора в отношении обработки и защиты",
        description: "<a href='/policies/confidential' class='text-blue-400'>Политика конфиденциальности</a>",
    },
    {
        id: 6,
        name: "Способ предоставления Cогласия",
        description: "Путем продолжения использования Сайта",
    },
    {
        id: 7,
        name: "Срок действия Согласия",
        description: "Согласие Пользователя на обработку ПДн действует с момента " +
            "подключения к Сайту и до достижения заявленных целей " +
            "обработки или до момента его отзыва",
    },
]
</script>

<style scoped>

</style>
